Automation_Selenium/WebApp_Flask/log/automation_CEPTestSuite-consultaCEP_TestCase-tc004_consultaCEP_invalido-0-OK.txt

Status: OK
Time Taken: 118
Size: 359
Timestamp: Fri Jan 08 10:07:32 BRST 2021
TestStep: tc004_consultaCEP_invalido

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.5 (Java/12.0.1)
Host : apps.correios.com.br
Accept-Encoding : gzip,deflate
Content-Length : 329
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <cli:consultaCEP>
         <!--Optional:-->
         <cep>avcds</cep>
      </cli:consultaCEP>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Server : Apache/2.4.38 (Debian)
X-OPNET-Transaction-Trace : a2_9c855717-f3e4-430a-a592-30a6a787b30b
Content-Encoding : gzip
Connection : close
Vary : Accept-Encoding,User-Agent
Set-Cookie : _op_aixPageId=a2_9c855717-f3e4-430a-a592-30a6a787b30b; Path=/
Set-Cookie : app-%3FINTERNO%3Fpool_proxy_app_sigep_443=PNCCAIAK; Expires=Fri, 08-Jan-2021 12:26:42 GMT; Path=/
Set-Cookie : sto-id-%3FEXTERNO_2%3Fpool_Proxy_reverso_Apps_443=MOABKIMA; Expires=Fri, 08-Jan-2021 12:26:42 GMT; Path=/
#status# : HTTP/1.1 500 Internal Server Error
Content-Length : 221
Date : Fri, 08 Jan 2021 12:06:42 GMT
Content-Type : text/xml;charset=UTF-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <soap:Fault>
         <faultcode>soap:Server</faultcode>
         <faultstring>CEP INVÁLIDO</faultstring>
         <detail>
            <ns2:SigepClienteException xmlns:ns2="http://cliente.bean.master.sigep.bsb.correios.com.br/">CEP INVÁLIDO</ns2:SigepClienteException>
         </detail>
      </soap:Fault>
   </soap:Body>
</soap:Envelope>
